Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_179-Teaching_The_Relative_and_Ultimate_Truths-v1.tmx
Source language: bo
Languages: en

source: དེ་ཡང་དོན་དམ་པའི་མེ་འབར་བས་ཡོངས་སུ་སྨིན་པར་བྱས་པས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་མི་དམིགས་པའི་ཚུལ་གྱིས་འགྱུར་རོ། །
en: Moreover, through the blazing fire of the ultimate, they ripen beings and thereby transform them, without relying on reference points, into the omniscient wisdom that is endowed with all supreme aspects.

source: འོད་སྲུང་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་འདུས་མ་བྱས་ཐོབ་པའི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དམིགས་པ་ཅན་ཐམས་ཅད་མི་དམིགས་པའི་ཚུལ་གྱིས་ཟིལ་གྱིས་གནོན་ཏོ། །
en: “Kāśyapa, this is how the bodhisattva great beings, without relying on reference points, outshine the hearers and solitary buddhas who rely on reference points and who have attained the unconditioned.

source: འོད་སྲུང་འདི་ལྟ་སྟེ། དཔེར་ན་གྲོང་ཁྱེར་ཆེན་པོར་ཆུད་པའི་མཆིང་བུའི་ནོར་བུ་ཁུར་བརྒྱ་སྟོང་དུ་གྱུར་པ་དང་།
en: “Kāśyapa, as another analogy, imagine a city that contains hundreds of thousands of semiprecious trinkets.

source: རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཡོད་པ་གྲུར་བཅུག་པ།
en: At the same time, there is a boat on the ocean that easily and effortlessly brings to land precious and valuable gemstones of beryl.

source: རིན་ཆེ་བའི་བཻ་དཱུརྱ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་བདེ་ཞིང་ཉེ་ཞོ་མེད་པར་འཛམ་བུའི་གླིང་དུ་ཕྱིན་ན་དེ་ཇི་སྙམ་དུ་སེམས། གྲོང་ཁྱེར་ཆེན་པོར་ཆུད་པའི་མཆིང་བུའི་ནོར་བུས་གྲུའི་ནང་དུ་བཅུག་པ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་ནོར་བུ་རིན་པོ་ཆེ་ཟིལ་གྱིས་ནོན་པར་ནུས་སམ།
en: Now, what do you think: could the semiprecious stones found in the city outshine the precious gemstones of beryl?”

source: འོད་སྲུང་ཇི་ལྟར་གྲོང་ཁྱེར་ཆེན་པོར་ཆུད་པའི་མཆིང་བུའི་ནོར་བུ་བཞིན་དུ།
en: “Kāśyapa, just like the semiprecious trinkets found in the city,

source: འདུས་མ་བྱས་ཐོབ་པའི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དམིགས་པ་ཅན་ཐམས་ཅད་དུ་བལྟའོ། །
en: so should you view the hearers and solitary buddhas who rely on reference points and their attainment of the unconditioned.

source: འོད་སྲུང་ཇི་ལྟར་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་བཻ་དཱུརྱ་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཡོད་པ་གྲུར་བཅུག་པ་བདེ་ཞིང་ཉེ་ཞོ་མེད་པར་ཚོང་ཁང་གི་བར་དུ་འོངས་པར་གྱུར་པ།
en: Kāśyapa, just like the most valuable gemstones of beryl, which are first discovered in the ocean, then boarded on to the ship, and easily and effortlessly arrive at the trading house,

source: འོད་སྲུང་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཁོར་བའི་གྲོང་ཁྱེར་གྱི་ཚོང་ཁང་གི་བར་དུ་འོངས་ན་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་འཇོག་པའི་ཚུལ་གྱིས་རབ་ཏུ་འགོད་པར་བལྟའོ། །
en: so, Kāśyapa, should you view the bodhisattva great beings who arrive at the trading houses in the city of cyclic existence and, without establishing anyone, establish all beings in unsurpassed and perfectly complete awakening.

source: འོད་སྲུང་འདི་ལྟ་སྟེ།
en: “Kāśyapa, consider a further analogy.

source: དཔེར་ན་དཔྱིད་ཟླ་ཐ་ཆུངས་ཀྱི་ཟླ་བ་ལ་
en: During the third month of spring,

source: ས་ཆེན་པོ་ལོ་ཏོག་གིས་རབ་ཏུ་གང་བ་ལ་གྲོག་སྦུར་ཕྲ་མོས་ཟས་ཀྱི་འབྲུ་གཅིག་ཁྱེར་བ་དང་།
en: the entire land is filled with crops.

source: ས་ཆེན་པོ་འདི་དེ་དག་གིས་གང་བ་གཉིས་གང་མང་བར་སེམས།
en: If, at that time, a small insect should carry off a single grain to eat, which would be larger, that single grain or all the grains found on the entire land?”

source: བཅོམ་ལྡན་འདས་ལོ་ཏོག་གིས་གང་བའི་ས་ཆེན་པོ་དེ་དཔག་ཏུ་མ་མཆིས་པའི་འབྲུའི་ཕུང་པོ་ཆེན་པོ་འབྱུང་བར་འགྱུར་ཏེ།
en: “Blessed One, the entire world filled with crops would have an infinitely greater pile of grains,

source: དེས་སེམས་ཅན་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པ་རྣམས་ཚིམ་པར་འགྱུར་གྱི།
en: which would be able to nourish uncountable, limitless beings.

source: བཅོམ་ལྡན་འདས་གྲོག་སྦུར་ཕྲ་མོས་འཚལ་བའི་ཟས་ཀྱི་འབྲས་བུས་ལྟ་ཅི་ཞིག་བགྱི་སྟེ། དེས་སེམས་ཅན་གང་ཡང་འཚོ་བར་མི་འགྱུར་རོ། །
en: At the same time, Blessed One, the single grain that the small insect carried off to eat could not even sustain a single being.”

source: འོད་སྲུང་ཇི་ལྟར་གྲོག་སྦུར་ཕྲ་མོས་ཁྱེར་བའི་ཟས་ཀྱི་འབྲུ་གཅིག་པོ་དེ་བཞིན་དུ་འོད་སྲུང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དམིགས་པ་ཅན་ཐམས་ཅད་ཀྱི་ཟག་པ་མེད་པའི་རྣམ་པར་གྲོལ་བའི་འབྲས་བུར་བལྟའོ། །
en: “Kāśyapa, you should see the result that is the undefiled liberation of all hearers and solitary buddhas who rely on reference points as being just like the single grain that the small insect carried off to eat.

source: འོད་སྲུང་ཇི་ལྟར་ལོ་ཏོག་མང་པོས་རབ་ཏུ་གང་བའི་ས་ཆེན་པོ་དེ་བཞིན་དུ་
en: On the other hand, Kāśyapa, it is as being like the entire earth filled with crops that you should see,

source: འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་གནས་པའི་ཚུལ་གྱིས་ཀུན་རྫོབ་དང་དོན་དམ་པའི་བདེན་པ་ལ་གནས་པས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། བླ་ན་མེད་པར་བསྡུས་པའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་དགེ་བའི་རྩ་བའི་ལོ་ཏོག་ཏུ་བལྟའོ། །
en: Kāśyapa, the crops of the bodhisattva great beings’ roots of virtue; they are the accumulations of merit and wisdom that in an unsurpassed manner embody the entire buddhadharma, such as the six perfections, by means of abiding, without abiding, within the relative and ultimate truths.

source: དེ་ཡོངས་སུ་སྨིན་པར་གྱུར་ནས་འདི་ལྟ་སྟེ།
en: When they have ripened,

source: བླ་ན་མེད་པ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱི་བདེ་བ་མི་དམིགས་པའི་ཚུལ་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་འགྱུར་རོ། །
en: the bliss of the unsurpassed wisdom that is endowed with the supreme of all aspects becomes, in a manner that is beyond reference points, the sustenance of all beings.”

source: བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །
en: “Blessed One, that is amazing!

source: བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ། །
en: Blissful One, that is amazing!

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་འཆད་པའི་ཚུལ་གྱིས་ཇི་ལྟར་བཤད་པ་དེ་དེ་བཞིན་ནོ། །
en: It is exactly as the Blessed One has explained, without explaining.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ།
en: Blessed One, that is how the bodhisattva great beings, by means of the unsurpassed wisdom beyond focus,

source: བླ་ན་མ་མཆིས་པ་མི་དམིགས་པའི་ཡེ་ཤེས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དད་པས་སྤྱོད་པའི་ས་ལ་མི་སྤྱོད་པའི་ཚུལ་གྱིས་སྤྱོད་པས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དམིགས་པ་ཅན་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་ཏོ། །
en: which is endowed with the supreme of all aspects, engage in, without engaging in, the level of faithful practice—and thereby outshine the hearers and solitary buddhas who rely on reference points.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་འཕགས་པ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ལྷན་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་འདིར་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གིས་བསྟན་པ་འདི་ཐོས་ནས།
en: The bodhisattva great beings from the buddha realm of the Blessed Thus-gone Ratnaketu, who had arrived here in the Sahā world together with noble Mañjuśrī,

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: “Blessed One, it is like this.

source: ཉན་ཐོས་དང་།
en: The instructions of the hearers

source: རང་སངས་རྒྱས་དམིགས་པ་ཅན་
en: and solitary buddhas who rely on reference points,

source: ཀུན་ནས་ཉོན་མོངས་པ་སྤོང་བའི་བཀའ་མཆིད་དང་།
en: such as the way to abandon disturbing emotions

source: ལྟུང་བ་རྣམ་པར་གཞག་པའི་བར་གྱི་བཀའ་མཆིད་
en: and determine downfalls,

source: འདི་དག་ཐམས་ཅད་ནི་སྤྲོས་པའི་བཀའ་མཆིད་དོ། །
en: are all conceptual and specific instructions

source: རྣམ་པ་ཐ་དད་པའི་བཀའ་མཆིད་དོ། །དམིགས་པའི་བཀའ་མཆིད་དེ།
en: that involve reference points.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ན་དེ་ལྟ་བུའི་དམིགས་པ་ཅན་གྱི་བཀའ་མཆིད་མ་མཆིས་སོ། །
en: “In the buddha realm of the Blessed, thus-gone, worthy, perfect Buddha Ratnaketu, there are no such instructions that involve reference points.

source: དེ་ལྟ་བུའི་དམིགས་པ་ཅན་གྱི་བཀའ་མཆིད་མི་གདའ་སྟེ།
en: Such instructions that involve focus do not exist there.

source: བཅོམ་ལྡན་འདས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དག་པའི་བཀའ་མཆིད་མི་ཐོས་པའི་ཚུལ་གྱིས་ཐོས་སོ། །
en: Instead, Blessed One, the beings there listen, without listening, to the pure instructions of the bodhisattva great beings.

source: ཕྱིར་མི་ལྡོག་པའི་བཀའ་མཆིད་མི་ཐོས་པའི་ཚུལ་གྱིས་ཐོས་སོ། །
en: They listen, without listening, to the irreversible instructions.

source: མི་དམིགས་པའི་བཀའ་མཆིད་མི་ཐོས་པའི་ཚུལ་གྱིས་ཐོས་སོ། །
en: They listen, without listening, to the instructions beyond reference points.

source: དོན་དམ་པར་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་སྐྱེས་པའི་བཀའ་མཆིད་མི་ཐོས་པའི་ཚུལ་གྱིས་ཐོས་སོ། །
en: They listen, without listening, to the instructions on how all phenomena are ultimately utterly unborn.

source: དོན་དམ་པར་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་བྱུང་བའི་བཀའ་མཆིད་མི་ཐོས་པའི་ཚུལ་གྱིས་ཐོས་སོ། །
en: They listen, without listening, to the instructions on how all phenomena are ultimately utterly unarisen.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ནི་ཤིན་ཏུ་དཀའ་བ་མཛད་དེ།
en: “The Blessed, thus-gone, worthy, perfect Buddha Śākyamuni underwent great hardship.

source: གང་འདི་སྙེད་ཀྱི་ཉམ་ང་བ་བཟོད་ཅིང་གང་ཐམས་ཅད་དོན་དམ་པར་ཤིན་ཏུ་མ་སྐྱེས་པ་ལ།
en: Having patience with so much suffering, and understanding that ultimately all phenomena are utterly unborn,

source: ཆོས་རྣམས་རབ་འབྲིང་ཐ་མར་སྟོན་པར་མཛད་དོ། །
en: he taught the higher, middling, and lower Dharma.

source: འདི་ལྟ་སྟེ།
en: “It is like this:

source: དོན་དམ་པར་ན་ཤིན་ཏུ་མ་སྐྱེས་པ་དང་།
en: ultimately all phenomena are utterly unborn,

source: མ་བྱུང་བ་དང་།
en: utterly unarisen,

source: དངོས་པོ་མ་མཆིས་པའི་རྣམ་པ་སྟེ།
en: and utterly unreal.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་དོན་དམ་པར་ཆོས་ཐམས་ཅད་རྣམ་པ་གཅིག་ལས་སེམས་ཅན་རྣམས་ཀྱི་དམིགས་པ་གཞོམ་པའི་སླད་དུ་མི་སྟོན་པའི་ཚུལ་གྱིས་རྣམ་པ་དུ་མར་ཆོས་སྟོན་ཏོ། །
en: However, from this single identity that all phenomena share on the ultimate level, the Blessed One teaches the Dharma, without teaching, in many ways in order to accommodate the reference points of beings.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་རྣམས་ཀྱིས།
en: The bodhisattva great beings then began to venerate the Blessed, Thus-gone, Worthy, Perfect Buddha Śākyamuni with exquisite offerings,

source: ལྷའི་མེ་ཏོག་དང་།
en: such as divine flowers,

source: སྤོས་དང་།
en: fragrant herbs,

source: བདུག་པ་དང་། ཕྲེང་བ་དང་།
en: incense, flower garlands,

source: བྱུག་པ་དང་། ཕྱེ་མ་དང་།
en: unguents, powders,

source: ཆོས་གོས་དང་། གདུགས་དང་།
en: robes, parasols,

source: རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: standards, banners,

source: རྣམ་པར་རྒྱལ་བའི་བ་དོན་དང་བཅས་པའི་བླ་རེས།
en: and canopies with victory banners.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་བླ་ན་མེད་པའི་མཆོད་པ་བྱས་ནས།
en: They addressed Mañjuśrī Kumārabhuta.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “Mañjuśrī,” they said,

source: འཇམ་དཔལ་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བར་འདོང་ངོ་། །
en: “we will now proceed to Jewel World.”

source: རིགས་ཀྱི་བུ་དག་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་དེང་ཤིག །
en: “Children of noble family, if you know that the time has come to leave, then do so.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་སྨྲས་པ།
en: The bodhisattva great beings asked him,

source: འཇམ་དཔལ་ཅི་ཁྱོད་ད་མི་འགྲོའམ།
en: “Mañjuśrī, are you not coming with us?”

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་གོ། །
en: “Children of noble family, all buddha realms are a single buddha realm.

source: དེ་བཞིན་དུ་སངས་རྒྱས་ཐམས་ཅད་ནི་སངས་རྒྱས་གཅིག་གོ། །
en: Likewise, all buddhas are a single buddha.

source: དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་ཆོས་གཅིག་གོ། །
en: Likewise, all dharmas are a single dharma.

source: དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ནི་སེམས་ཅན་གཅིག་གོ། །
en: Likewise, all beings are a single being.

source: དེ་དག་འདི་ལས་ཁྱད་པར་ཅི་ཡོད་ན།
en: Since there are no differences between these,

source: རིགས་ཀྱི་བུ་བདག་དེར་འགྲོ།
en: children of noble family, I will also go there.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་སྨྲས་པ།
en: The bodhisattva great beings asked,

source: འཇམ་དཔལ་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག །
en: “Mañjuśrī, in what way are all of the buddha realms a single buddha realm?

source: འཇམ་དཔལ་ཇི་ལྟར་སངས་རྒྱས་ཐམས་ཅད་སངས་རྒྱས་གཅིག །
en: Mañjuśrī, in what way are all buddhas a single buddha?

source: འཇམ་དཔལ་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཆོས་གཅིག །
en: Mañjuśrī, in what way are all dharmas are a single dharma?

source: འཇམ་དཔལ་ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་སེམས་ཅན་གཅིག །
en: Mañjuśrī, in what way are all beings a single being?”

source: རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནི་ཞིང་མ་ཡིན་ནོ། །
en: “Children of noble family, none of the buddha realms are realms.

source: དོན་དམ་པར་ཤིན་ཏུ་མ་སྐྱེས་པའི་ཕྱིར་རོ། །
en: Because ultimately they are utterly unborn.

source: རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཐམས་ཅད་ནི་སངས་རྒྱས་མ་ཡིན་ནོ། །
en: Children of noble family, none of the buddhas are buddhas.

source: དོན་དམ་པར་ན་ཤིན་ཏུ་མ་བྱུང་བའི་ཕྱིར་རོ། །
en: Because ultimately they are utterly unarisen.

source: རིགས་ཀྱི་བུ་དག་ཆོས་ཐམས་ཅད་ནི་ཆོས་མ་ཡིན་ནོ། །
en: Children of noble family, none of the dharmas are dharmas.

source: དོན་དམ་པར་ན་ཤིན་ཏུ་དངོས་པོ་མེད་པའི་ཕྱིར་རོ། །
en: Because ultimately they are utterly unreal.

source: རིགས་ཀྱི་བུ་དག་སེམས་ཅན་ཐམས་ཅད་ནི་སེམས་ཅན་མ་ཡིན་ནོ། །
en: Children of noble family, no beings are beings.

source: དོན་དམ་པར་ན་ཤིན་ཏུ་ཀུན་ནས་མ་བྱུང་བའི་ཕྱིར་རོ། །
en: Because ultimately they are all utterly and entirely unarisen.”

source: དེ་ནས་དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཅི་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་གི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་ཅི་འདྲ་བ་དེ་འདྲ་བར་ལྷག་ཆད་མེད་པར་སྣང་བ་དེ་ལྟ་བུར་བསམ་པ་རབ་ཏུ་རྫོགས་ནས་དེ་འདྲ་བར་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: With these words, Mañjuśrī Kumārabhuta caused this trichiliocosm to appear precisely, without any difference, like the Jewel World of the Blessed, Thus-gone Ratnaketu.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་དེ་དང་།
en: As he had thus fulfilled his intention, he rested evenly in absorption. Then the bodhisattva great beings also saw the Blessed, thus-gone, worthy,

source: འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེའང་མཐོང་སྟེ།
en: perfect Buddha Ratnaketu and the Jewel World.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་འདི་སྙམ་དུ་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བར་ཕྱིན་པར་སེམས་སོ། །
en: In fact the bodhisattva great beings all thought that they had arrived in the Jewel World.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཡང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་གི་ཁ་དོག་དང་དབྱིབས་ཅི་འདྲ་བ་བཞིན་དུ་མཐོང་ངོ་། །
en: Looking at the Blessed, thus-gone, worthy, perfect Buddha Śākyamuni, they saw him in the precise colors and shape of the Blessed, Thus-gone Ratnaketu.

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡིན་སྙམ་དུ་སེམས་སོ། །
en: Even the great hearers thought that they had become bodhisattva great beings.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་རིན་པོ་ཆེའི་ཏོག་ཡིན་སྙམ་པ་བྱེད་ནས་
en: The bodhisattva great beings, who thought that they were beholding Ratnaketu,

source: འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: asked the Blessed,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བགྱི་བ་འདིར་སུས་ཕྱིན་པར་བགྱིས།
en: Thus-gone Śākyamuni, “Blessed One, who has brought us to this Jewel World?”

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བཀའ་སྩལ་པ།
en: The Blessed Śākyamuni asked them,

source: རིགས་ཀྱི་བུ་དག་ཁྱེད་སུས་ཁྲིད།
en: “Children of noble family, who has led you?”

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བདག་ཅག་ཁྲིད་དོ། །
en: “Blessed One, Mañjuśrī Kumārabhuta led us.”

source: རིགས་ཀྱི་བུ་ཁྱེད་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མ་འོངས་མ་སོང་བའི་ཚུལ་གྱིས་ཕྱིན་པར་བྱས་སོ། །
en: “Children of noble family, Mañjuśrī Kumārabhuta has brought you here without coming and going.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Mañjuśrī Kumārabhuta told the bodhisattva great beings.

source: རིགས་ཀྱི་བུ་དག་ཁྱེད་གང་དུ་ཁྲིད། གང་ནས་ཁྲིད་པར་བྱས་པ་མཉམ་པར་ཞོག་ལ་ལྟོས་ཤིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་རང་རང་གི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་སྟེ་བལྟས་ན།
en: “Children of noble family, to find out where you are being led to, and from where you are being led, look with your equipoise!”

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེ་ཉིད་ནས་བདག་ཉིད་གང་དུ་ཡང་མ་གཡོས་པར་མཐོང་སྟེ།
en: When the bodhisattva great beings each looked through their meditative absorption, they saw that they had never moved from this Sahā world.

source: ངོ་མཚར་དུ་གྱུར་རྨད་དུ་གྱུར་ནས།
en: Amazed,

source: འདི་ལྟར་བདག་ཅག་སྟན་འདི་ཉིད་ལས་མ་འཕགས་པར་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱ་བར་ཡང་ཕྱིན་པ་སྙམ་བྱེད་དེ།
en: they were full of astonishment and exclaimed, “Although we never got up from our seats, we thought that we had traveled to the Jewel World.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བྱིན་གྱི་རླབས་མེད་པའི་ཚུལ་གྱིས་བྱིན་གྱི་རླབས་བསམ་གྱིས་མི་ཁྱབ་པོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: But it was Mañjuśrī who caused it all by means of his inconceivable blessing without blessing!”

source: དེ་དག་གིས་ཡང་སྨྲས་པ།
en: They then added,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱིན་གྱི་རླབས་འདི་ཐོབ་པར་གྱུར་ཅིག །
en: “Blessed One, may all beings also attain this blessing in a manner beyond reference point!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed Śākyamuni spoke to the bodhisattva great beings.

source: རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་
en: “Children of noble family, consider this analogy.

source: ནམ་མཁའ་ནི་སའི་སྣོད་དང་།
en: Space contains the earth,

source: ཤིང་གི་སྣོད་དང་།
en: and also wood,

source: ཁར་བའི་སྣོད་དང་།
en: zinc,

source: ཟངས་ཀྱི་སྣོད་དང་།
en: copper,

source: དངུལ་གྱི་སྣོད་དང་།
en: silver,

source: གསེར་གྱི་སྣོད་དང་།
en: gold,

source: ནོར་བུ་དང་།
en: as well gems,

source: མུ་ཏིག་དང་།
en: pearls,

source: བཻ་དཱུརྱ་དང་།
en: beryl,

source: དུང་དང་།
en: conch,

source: མན་ཤེལ་དང་།
en: crystal,

source: བྱི་རུ་དང་།
en: coral,

source: ཨ་མྲ་གར་བ་དང་། སྤུག་དང་།
en: The list also includes one type of stone cat’s eye,

source: དུང་གཡས་ཕྱོགས་སུ་འཁྱིལ་བ་དང་།
en: conch shells that coil to the right,

source: མུ་ཏིག་དམར་པོའི་སྣོད་ལ་སོགས་པའི་ནང་དུ་ཞུགས་པར་གྱུར་པ་
en: and red pearls, so that all these are contained within space.

source: རིགས་ཀྱི་བུ་དག་ཀུན་རྫོབ་ཏུ་སྣོད་ལ་ཐ་དད་པ་ཡོད་མོད་ཀྱི་ནམ་མཁའ་ལ་ཐ་དད་ཡོད་པ་མ་ཡིན་ནོ། །
en: Yet at the same time, children of noble family, although relatively there are of course different items contained, space itself remains undifferentiated.

source: དོན་དམ་པར་ན་ནམ་མཁའ་ཤིན་ཏུ་དངོས་པོ་མེད་པའི་ཕྱིར་ཏེ།
en: Because ultimately space is utterly unreal.

source: དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་དག་དོན་དམ་པར་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་སྐྱེས།
en: “Likewise, children of noble family, ultimately all phenomena are surely utterly unborn,

source: མ་བྱུང་།
en: utterly unarisen,

source: དངོས་པོ་མེད་མོད་ཀྱི།
en: and utterly unreal.

source: འཇིག་རྟེན་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་ཀྱིས་ཐ་སྙད་དུ་འདོགས་ཤིང་རབ་ཏུ་འཇོག་སྟེ།
en: And yet, through the relative conventions of the world, they are imputed and designated in a conventional manner:

source: འདི་ནི་གཟུགས་སོ། །
en: ‘This is form,

source: འདི་ནི་ཚོར་བའོ། །
en: this is feeling,

source: འདི་ནི་འདུ་ཤེས་སོ། །
en: this is perception,

source: འདི་དག་ནི་འདུ་བྱེད་རྣམས་སོ། །
en: this is formation,

source: འདི་ནི་རྣམ་པར་ཤེས་པའོ། །
en: this is consciousness.

source: འདི་དག་ནི་སྐྱེ་མཆེད་རྣམས་སོ། །
en: These are the sense fields.

source: འདི་དག་ནི་ཁམས་རྣམས་སོ། །
en: These are the elements.

source: འདི་ནི་སངས་རྒྱས་དཀོན་མཆོག་གོ། །
en: This is the Jewel of the Buddha.

source: འདི་ནི་ཆོས་དཀོན་མཆོག་གོ། །
en: This is the Jewel of the Dharma.

source: འདི་ནི་དགེ་འདུན་དཀོན་མཆོག་གོ། །
en: This is the Jewel of the Saṅgha.

source: འདི་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པའོ། །
en: This is the vehicle of the hearers.

source: འདི་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའོ། །
en: This is the vehicle of the solitary buddhas.

source: འདི་ནི་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོའོ། །
en: This is the unexcelled vehicle.

source: འདི་དག་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་སོ། །
en: These are the paths of the ten virtuous actions.

source: འདི་དག་ནི་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་སོ། །
en: These are the paths of the ten nonvirtuous actions.

source: འདི་དག་ནི་སེམས་ཅན་དམྱལ་བའོ། །
en: These are hell beings.

source: འདི་དག་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སོ། །
en: These are the animal existences.

source: འདི་དག་ནི་ཡི་དགས་ཀྱི་ཡུལ་ལོ། །
en: These are the abodes of the hungry spirits.

source: འདི་དག་ནི་ལྷ་མ་ཡིན་ནོ། །
en: These are demigods.

source: འདི་དག་ནི་མིའོ། །
en: These are humans.

source: འདི་དག་ནི་ལྷའོ། །
en: These are gods.

source: འདི་དག་ནི་འདོད་པ་ན་སྤྱོད་པའི་ལྷའོ། །
en: These are gods who experience desire.

source: འདི་དག་ནི་གཟུགས་ན་སྤྱོད་པའི་ལྷའོ། །
en: These are gods who experience form.

source: འདི་དག་ནི་གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལྷའོ། །
en: These are gods who experience the formless.

source: འདི་ནི་འདོད་པའི་ཁམས་སོ། །
en: This is the desire realm.

source: འདི་ནི་གཟུགས་ཀྱི་ཁམས་སོ། །
en: This is the form realm.

source: འདི་ནི་གཟུགས་མེད་པའི་ཁམས་སོ། །
en: This is the formless realm.

source: འདི་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པའོ། །
en: These are good physical actions.

source: འདི་ནི་ངག་གིས་ལེགས་པར་སྤྱོད་པའོ། །
en: These are good verbal actions.

source: འདི་ནི་ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པའོ། །
en: These are good mental actions.

source: འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of generosity.

source: འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of discipline.

source: འདི་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of patience.

source: འདི་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of diligence.

source: འདི་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of concentration.

source: འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of knowledge.

source: འདི་ནི་ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of skillful means.

source: འདི་ནི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of aspirations.

source: འདི་ནི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of strength.

source: འདི་ནི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the perfection of wisdom.

source: འདི་ནི་ས་བཅུ་དང་།
en: These are the ten levels,

source: དབང་བཅུ་དང་།
en: the ten powers,

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བཅུ་དང་།
en: the ten strengths of the bodhisattvas,

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: the ten strengths of the thus-gone ones,

source: མི་འཇིགས་པ་བཞི་དང་།
en: the fourfold fearlessness,

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: the four genuine discriminations,

source: དབང་པོ་ལྔ་དང་།
en: the five faculties,

source: སྟོབས་ལྔ་དང་།
en: the five power‌s,

source: ཇི་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་དང་།
en: the eighteen unique qualities of a buddha,

source: ཇི་ཙམ་དུ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་།
en: the omniscient wisdom that is endowed with the supreme of all aspects,

source: ཇི་ཙམ་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་།
en: the awakening of a buddha,

source: ཇི་ཙམ་དུ་དེ་བཞིན་ཉིད་དང་།
en: suchness,

source: ཡང་དག་པའི་མཐའ་དང་།
en: the limit of reality,

source: སྟོང་པ་ཉིད་དང་།
en: emptiness,

source: མཚན་མ་མེད་པ་དང་།
en: signlessness,

source: སྨོན་པ་མེད་པ་དང་།
en: wishlessness,

source: མངོན་པར་འདུས་མ་བྱས་པ་དང་།
en: the unconditioned,

source: ཇི་ཙམ་དུ་འདུས་བྱས་དང་།
en: all conditioned

source: འདུས་མ་བྱས་པའི་ཆོས་ཐམས་ཅད་དང་།
en: and unconditioned phenomena,

source: ཇི་ཙམ་དུ་འཁོར་བ་དང་།
en: saṃsāra

source: མྱ་ངན་ལས་འདའ་བ་དང་།
en: and nirvāṇa,

source: ཇི་ཙམ་དུ་སྨྲ་བ་དང་།
en: all speech

source: ཤེས་པ་དང་།
en: consciousness and objects of consciousness.’

source: ཤེས་བྱར་ཐ་སྙད་འདོགས་པ་དང་།
en: “In this way, as conventions are designated and connected,

source: འབྲེལ་པར་འཇུག་པ་དེ་ཙམ་དུ་འཇིག་རྟེན་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་འཇུག་གོ། །
en: the relative conventions of the world are applied.

source: དོན་དམ་པར་ན་སྤྱོད་པ་ཐམས་ཅད་མེད་པར་གྱུར་པ་སྟེ།
en: Ultimately, however, all experiences are nonexistent.
